-- phpMyAdmin SQL Dump
-- version 4.8.0.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 03, 2019 at 10:15 AM
-- Server version: 10.1.32-MariaDB
-- PHP Version: 5.6.36

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `asstest01`
--

-- --------------------------------------------------------

--
-- Table structure for table `conditions`
--

CREATE TABLE `conditions` (
  `con_id` int(10) NOT NULL,
  `aca_id` tinyint(2) NOT NULL,
  `e_name` tinyint(2) NOT NULL,
  `con_level` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  `con_con` varchar(30) COLLATE utf8_unicode_ci NOT NULL,
  `con_ex` text COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `conditions`
--

INSERT INTO `conditions` (`con_id`, `aca_id`, `e_name`, `con_level`, `con_con`, `con_ex`) VALUES
(1, 1, 1, '1', 'น้อยกว่า 16', 'ระดับที่ ๑. มีภาระงานน้อยกว่า ๑๖ชั่วโมงทำงาน/สัปดาห์'),
(2, 1, 1, '2', '16.00 -17.99', 'ระดับที่ ๒ มีภาระงานอยู่ระหว่าง ๑๖.๐๐ –๑๗.๙๙ ชั่วโมงทำงาน/สัปดาห์'),
(3, 1, 1, '3', '18.00 - 22.00', 'ระดับที่ ๓. มีภาระงานใกล้เคียงเกณฑ์ภาระงานขั้นต่ำ (ระหว่าง ๑๘.๐๐ –๒๒.๐๐ ชั่วโมงทำงาน/สัปดาห์) และมีแผนการสอนตาม มคอ.๓'),
(4, 1, 1, '4', '22.00 - 24.00', 'ระดับที่ ๔. มีภาระงานระหว่าง ๒๒.๐๑-๒๔.๐๐ ชั่วโมงทำงาน/สัปดาห์มีแผนการสอนตาม มคอ.๓ และ มีเอกสารประกอบการสอน/เอกสารคำสอน/ตำรา/สื่อการสอน/อุปกรณ์การสอน ทุกวิชาที่สอน หรือ  มีภาระงานระหว่าง ๒๒.๐๑-๒๔.๐๐ ชั่วโมงทำงาน/สัปดาห์ มีแผนการสอนตาม มคอ.๓และมีงานวิจัย '),
(5, 1, 1, '5', 'มากกว่า 24', 'ระดับที่ ๕. มีภาระงานมากกว่า ๒๔.๐๐ชั่วโมงทำงาน/สัปดาห์  มีแผนการสอนตาม มคอ.๓ มีการนำผลการประเมินไปปรับปรุง มีเอกสารประกอบการสอน/เอกสารคำสอน/ตำรา/สื่อการสอน/อุปกรณ์การสอน ทุกวิชาที่สอน และมีงานวิจัย'),
(6, 1, 2, '1', 'น้อยกว่า 16', 'ระดับที่ ๑. มีภาระงานน้อยกว่า ๑๖ชั่วโมงทำงาน/สัปดาห์'),
(7, 1, 2, '2', '16.00 -17.99', 'ระดับที่ ๒. มีภาระงานอยู่ระหว่าง ๑๖.๐๐ –๑๗.๙๙ ชั่วโมงทำงาน/สัปดาห์'),
(8, 1, 2, '3', '18.00 - 22.00', 'ระดับที่ ๓. มีภาระงานใกล้เคียงเกณฑ์ภาระงานขั้นต่ำ (ระหว่าง ๑๘.๐๐ –๒๒.๐๐ ชั่วโมงทำงาน/สัปดาห์) และมีแผนการสอนตาม มคอ.๓'),
(9, 1, 2, '4', '18.00 - 22.00', 'ระดับที่ ๔. มีภาระงานระหว่าง ๒๒.๐๑-๒๔.๐๐ ชั่วโมงทำงาน/สัปดาห์มีแผนการสอนตาม มคอ.๓ และ มีเอกสารประกอบการสอน/เอกสารคำสอน/ตำรา/สื่อการสอน/อุปกรณ์การสอน ทุกวิชาที่สอน หรือ  มีภาระงานระหว่าง ๒๒.๐๑-๒๔.๐๐ ชั่วโมงทำงาน/สัปดาห์ มีแผนการสอนตาม มคอ.๓และมีงานวิจัย '),
(10, 1, 2, '5', 'มากกว่า 24', 'ระดับที่ ๕. มีภาระงานมากกว่า ๒๔.๐๐ชั่วโมงทำงาน/สัปดาห์  มีแผนการสอนตาม มคอ.๓ มีการนำผลการประเมินไปปรับปรุง มีเอกสารประกอบการสอน/เอกสารคำสอน/ตำรา/สื่อการสอน/อุปกรณ์การสอน ทุกวิชาที่สอน และมีงานวิจัย'),
(11, 1, 3, '1', 'ต่ำกว่า 3.20', 'ระดับที่ ๑. มีภาระงานต่ำกว่า๓.๒๐ ชั่วโมงทำงาน/สัปดาห์หรือ เป็นวิทยากรบรรยายพิเศษใน/นอกมหาวิทยาลัย ๑ ครั้งต่อรอบประเมิน หรือร่วมจัดประชุม สัมมนาฝึกอบรมและจัดนิทรรศการ แก่หน่วยงานภายนอก ๑ ครั้งต่อรอบประเมิน'),
(12, 1, 3, '2', '3.20 - 3.59', 'ระดับที่ ๒.มีภาระงานระหว่าง ๓.๒๐ – ๓.๕๙ ชั่วโมงทำงาน/สัปดาห์หรือ จัดกิจกรรมตามประกาศ ๙.๑-๙.๓   ๒ ครั้ง ต่อรอบประเมิน หรือ เป็นที่ปรึกษาร่วมโครงการพิเศษนักศึกษา ๑ เรื่อง'),
(13, 1, 3, '3', '3.60 - 4.40', 'ระดับที่ ๓. ปฎิบัติงานใกล้เคียงกับภาระงานขั้นต่ำ (ระหว่าง ๓.๖๐ -๔.๔๐ ชั่วโมงทำงาน/สัปดาห์)\r\nหรือ  มีภาระงานตามประกาศ ข้อ ๙.๑-๙.๓ หน้า ๑๑  ใด ๆ ก็ได้ ๓ เรื่อง หรือ มีภาระงานกิจกรรมใด ๆ ข้อ ก็ได้ ข้อ๙.๑-๙.๓ จำนวน ๒ เรื่อง และเป็นที่ปรึกษาร่วมโครงการวิจัยนักศึกษา ๑ เรื่อง\r\n'),
(14, 1, 3, '4', '4.41 - 4.80', 'ระดับที่ ๔.มีภาระงานระหว่าง ๔.๔๑ – ๔.๘๐ชั่วโมงทำงาน/สัปดาห์หรือมีภาระงานตามประกาศ ข้อ ๙.๑-๙.๓ หน้า ๑๑ ใด ๆ ก็ได้ ๔ เรื่อง หรือ มีภาระงานกิจกรรมใด ๆ ข้อ ก็ได้ ข้อ ๙.๑-๙.๓ จำนวน๓ เรื่อง และเป็นที่ปรึกษาโครงการวิจัยนักศึกษา ๑ เรื่อง'),
(15, 1, 3, '5', 'มากกว่า 4.80', 'ระดับที่ ๕. มีภาระงานมากกว่า ๔.๘๐ ชั่วโมงทำงาน/สัปดาห์ หรือ  มีภาระงานตามประกาศ ข้อ ๙.๑-๙.๓ หน้า ๑๑ใด ๆ ก็ได้๔ เรื่อง และสามารถหารายได้จากงานภายนอก มากกว่า ๑๐,๐๐๐ บาทหรือ มีภาระงานกิจกรรมใด ๆ ข้อ ก็ได้ ข้อ ๙.๑-๙.๓ จำนวน ๓ เรื่อง และเป็นที่ปรึกษาโครงการวิจัยนักศึกษา ๑ เรื่องและสามารถหารายได้จากงานภายนอก มากกว่า ๑๐,๐๐๐บาท ขึ้นไป หรือ สามารถหารายได้จากภายนอกตั้งแต่ ๑๐๐,๐๐๐บาท ขึ้นไป'),
(16, 1, 4, '1', ' ต่ำกว่า 3.20', 'ระดับที่ ๑. มีภาระงานต่ำกว่า ๓.๒๐ ชั่วโมงทำงาน/สัปดาห์ หรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๑ งาน'),
(17, 1, 4, '2', '3.20 - 3.59', 'ระดับที่ ๒.มีภาระงานระหว่าง ๓.๒๐ – ๓.๕๙ ชั่วโมงทำงาน/สัปดาห์\r\nหรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๒ งาน\r\n'),
(18, 1, 4, '3', '3.60 - 4.40', 'ระดับที่ ๓. ปฎิบัติงานใกล้เคียงกับภาระงานขั้นต่ำ (ระหว่าง ๓.๖๐ – ๔.๔๐ ชั่วโมงทำงาน/สัปดาห์)\r\nหรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๓ งาน\r\n'),
(19, 1, 4, '4', '4.41 - 4.80', 'ระดับที่ ๔.มีภาระงานระหว่าง ๔.๔๑ – ๔.๘๐ ชั่วโมงทำงาน/สัปดาห์\r\nหรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๔ งาน\r\n'),
(20, 1, 4, '5', 'มากกว่า 4.80', 'ระดับที่ ๕.มีภาระงานมากกว่า ๔.๘๐ชั่วโมงทำงาน/สัปดาห์ หรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๕ งาน\r\n'),
(21, 1, 5, '1', '6.40', 'ระดับที่ ๑. มีภาระงานต่ำกว่า ๖.๔๐ ชั่วโมงทำงาน/สัปดาห์ หรือเป็นกรรมการใดกรรมการหนึ่งของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๑งาน หรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๒ งาน\r\n'),
(22, 1, 5, '2', '6.40 - 7.19', 'ระดับที่ ๒. มีภาระงานระหว่าง ๖.๔๐ – ๗.๑๙ ชั่วโมงทำงาน/สัปดาห์ หรือเป็นกรรมการใดกรรมการหนึ่งของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๒ งาน หรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๓ งาน\r\n'),
(23, 1, 5, '3', '7.20 - 8.80', 'ระดับที่ ๓. ปฎิบัติงานใกล้เคียงกับภาระงานขั้นต่ำ (ระหว่าง ๗.๒๐ – ๘.๘๐ ชั่วโมงทำงาน/สัปดาห์) หรือ เป็นอาจารย์ที่ปรึกษา หรือเป็นกรรมการใดกรรมการหนึ่งของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๒ งานและกรรมการเฉพาะกิจ ๑ งาน\r\nหรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๔ งาน\r\n'),
(24, 1, 5, '4', '8.81 - 9.60', 'ระดับที่ ๔.มีภาระงานระหว่าง ๘.๘๑  – ๙.๖๐ ชั่วโมงทำงาน/สัปดาห์\r\nหรือ เป็นอาจารย์ที่ปรึกษาและเป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๑ งาน หรือ เป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๔ งาน\r\n'),
(25, 1, 5, '5', '9.60 ขึ้นไป ', 'ระดับที่ ๕. มีภาระงานมากกว่า ๙.๖๐ ชั่วโมงทำงาน/สัปดาห์หรือ เป็นอาจารย์ที่ปรึกษาและเป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๒ งาน หรือ เป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๕ งาน หรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๖ งาน\r\n'),
(26, 2, 1, '1', 'น้อยกว่า 6.40', 'ระดับที่ ๑. มีภาระงานน้อยกว่า ๖.๔๐ชั่วโมงทำงาน/สัปดาห์'),
(27, 2, 1, '2', '6.40 - 7.16', 'ระดับที่ ๒. มีภาระงานระหว่าง ๖.๔๐ – ๗.๑๖ ชั่วโมง ทำงาน/สัปดาห์'),
(28, 2, 1, '3', '7.13 - 8.80', 'ระดับที่ ๓. มีภาระงานใกล้เคียงเกณฑ์ภาระงานขั้นต่ำ (ระหว่าง ๗.๑๗ –๘.๘๐ ชั่วโมงทำงาน/สัปดาห์)และมีแผนการสอนตาม มคอ.๓'),
(29, 2, 1, '4', '8.81 - 9.60', 'ระดับที่ ๔. มีภาระงานมากกว่า ๘.๘๑- ๙.๖๐ ชั่วโมงทำงาน/สัปดาห์และมีแผนการสอนตาม มคอ.๓ และมีเอกสารประกอบการสอน/เอกสารคำสอน/ตำรา/สื่อการสอน/อุปกรณ์การสอน ทุกวิชาที่สอน '),
(30, 2, 1, '5', 'มากกว่า 9.61', 'ระดับที่ ๕. มีภาระงานมากกว่า ๙.๖๑ ชั่วโมงทำงาน/สัปดาห์ และมีแผนการสอนตาม มคอ.๓ มีการนำผลการประเมินไปปรับปรุง และมีเอกสารประกอบการสอน/เอกสารคำสอน/ตำรา/สื่อการสอน/อุปกรณ์การสอน ทุกวิชาที่สอน '),
(31, 2, 2, '1', '', 'ระดับที่ ๑. มีการดำเนินงานวิจัย ที่ได้รับงบประมาณจากแหล่งทุนภายนอก/ เป็นกรรมการที่เกี่ยวข้องกับงานวิจัย '),
(32, 2, 2, '2', '', 'ระดับที่ ๒. มีการดำเนินงานวิจัยและเผยแพร่ผลงานวิจัยในที่ประชุมวิชาการในระดับนานาชาติ /เข้าร่วมกิจกรรมด้านการวิจัย/นำผลงานวิจัยไปบูรณาการกับการบริการวิชาการและการเรียนการสอน'),
(33, 2, 2, '3', '', 'ระดับที่ ๓. มีการเผยแพร่บทความทางวิชาการ                                  ในวารสารวิชาการ ที่อยู่ในฐานข้อมูล เป็นที่ยอมรับในระดับสากล  โดยเป็นชื่อแรกหรือเป็นผู้เขียนหลัก(Corresponding author) '),
(34, 2, 2, '4', '', 'ระดับที่ ๔. การเผยแพร่บทความทางวิชาการในวารสารวิชาการที่อยู่ในฐานข้อมูล เป็นที่ยอมรับในระดับสากล  โดยเป็นชื่อแรกหรือเป็นผู้เขียนหลัก(Corresponding author) อย่างน้อย ๓ เรื่อง'),
(35, 2, 2, '5', '', 'ระดับที่ ๕. มีการตอบรับการตีพิมพ์ หรือตีพิมพ์ผลงานวิจัยในวารสารที่อยู่ในฐานข้อมูล เป็นที่ยอมรับในระดับสากล  โดยเป็นชื่อแรกหรือเป็นผู้เขียนหลัก(Corresponding author) อย่างน้อย  ๓ เรื่องและ ทำตำรา/หนังสือที่ได้รับการเผยแพร่ตามเกณฑ์ที่ ก.พ.อ.กำหนด'),
(36, 2, 3, '1', 'ต่ำกว่า 3.20', 'ระดับที่ ๑. มีภาระงานต่ำกว่า ๓.๒๐ ชั่วโมงทำงาน/สัปดาห์หรือ เป็นวิทยากรบรรยายพิเศษใน/นอกมหาวิทยาลัย ๑ ครั้งต่อรอบประเมิน หรือร่วมจัดประชุม สัมมนาฝึกอบรมและจัดนิทรรศการ แก่หน่วยงานภายนอก ๑ ครั้งต่อรอบประเมิน'),
(37, 2, 3, '2', '3.20 - 3.59', 'ระดับที่ ๒.มีภาระงานระหว่าง ๓.๒๐ – ๓.๕๙ ชั่วโมงทำงาน/สัปดาห์หรือ จัดกิจกรรมตามประกาศ ๙.๑-๙.๓  ๒ ครั้ง ต่อรอบประเมิน หรือ เป็นที่ปรึกษาร่วมโครงการพิเศษนักศึกษา ๑ เรื่อง'),
(38, 2, 3, '3', '3.60 - 4.40', 'ระดับที่ ๓. ปฏิบัติงานใกล้เคียงกับภาระงานขั้นต่ำ (ระหว่าง ๓.๖๐ -๔.๔๐ ชั่วโมงทำงาน/สัปดาห์)\r\nหรือ  มีภาระงานตามประกาศ ข้อ ๙.๑-๙.๓ หน้า ๑๑ ใด ๆ ก็ได้ ๓ เรื่อง หรือ มีภาระงานกิจกรรมใด ๆ ข้อ ก็ได้ ข้อ๙.๑-๙.๓จำนวน ๒ เรื่อง และเป็นที่ปรึกษาร่วมโครงการวิจัยนักศึกษา ๑ เรื่อง\r\n'),
(39, 2, 3, '4', '4.41 - 4.80', 'ระดับที่ ๔.มีภาระงานระหว่าง ๔.๔๑ – ๔.๘๐ ชั่วโมงทำงาน/สัปดาห์ หรือ  มีภาระงานตามประกาศ ข้อ ๙.๑-๙.๓ หน้า ๑๑ ใด ๆ ก็ได้ ๔ เรื่อง หรือ มีภาระงานกิจกรรมใด ๆ ข้อ ก็ได้ ข้อ๙.๑-๙.๓ จำนวน ๒ เรื่อง และเป็นที่ปรึกษาโครงการวิจัยนักศึกษา ๑ เรื่อง'),
(40, 2, 3, '5', 'มากกว่า 4.80', 'ระดับที่ ๕. มีภาระงานมากกว่า ๔.๘๐ ชั่วโมงทำงาน/สัปดาห์ หรือ  มีภาระงานตามประกาศ ข้อ ๙.๑๙.๓ หน้า ๑๑ ใด ๆ ก็ได้ ๔ เรื่อง และสามารถหารายได้จากงานภายนอก มากกว่า ๑๐,๐๐๐ หรือ มีภาระงานกิจกรรมใด ๆ ข้อ ก็ได้ ข้อ ๙.๑ -๙.๓ จำนวน ๒ เรื่อง และเป็นที่ปรึกษาโครงการวิจัยนักศึกษา ๑ เรื่องและสามารถหารายได้จากงานภายนอก มากกว่า ๑๐,๐๐๐บาท ขึ้นไป หรือ สามารถหารายได้จากภายนอกตั้งแต่ ๑๐๐,๐๐๐บาท ขึ้นไป'),
(41, 2, 4, '1', 'มากกว่า 3.20', 'ระดับที่ ๑. มีภาระงานต่ำกว่า ๓.๒๐ ชั่วโมงทำงาน/สัปดาห์ หรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๑ งาน'),
(42, 2, 4, '2', '3.20 - 3.59', 'ระดับที่ ๒.มีภาระงานระหว่าง ๓.๒๐ – ๓.๕๙ ชั่วโมงทำงาน/สัปดาห์\r\nหรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๒ งาน\r\n'),
(43, 2, 4, '3', '3.60 - 4.40', 'ระดับที่ ๓. ปฎิบัติงานใกล้เคียงกับภาระงานขั้นต่ำ (ระหว่าง ๓.๖๐ – ๔.๔๐ชั่วโมงทำงาน/สัปดาห์)\r\nหรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๓ งาน\r\n'),
(44, 2, 4, '4', '4.41 - 4.80', 'ระดับที่ ๔.มีภาระงานระหว่าง ๔.๔๑ – ๔.๘๐ ชั่วโมงทำงาน/สัปดาห์\r\nหรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๔ งาน\r\n'),
(45, 2, 4, '5', 'มากกว่า 4.80', 'ระดับที่ ๕.มีภาระงานมากกว่า ๔.๘๐ชั่วโมงทำงาน/สัปดาห์\r\nหรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๕ งาน\r\n'),
(47, 2, 5, '1', 'ต่ำกว่า 6.40', 'ระดับที่ ๑. มีภาระงานต่ำกว่า ๖.๔๐ชั่วโมงทำงาน/สัปดาห์\r\nหรือเป็นกรรมการใดกรรมการหนึ่งของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๑ งาน หรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๒ งาน\r\n'),
(48, 2, 5, '2', '6.40 - 7.19', 'ระดับที่ ๒.มีภาระงานระหว่าง ๖.๔๐ – ๗.๑๙ ชั่วโมงทำงาน/สัปดาห์\r\nหรือเป็นกรรมการใดกรรมการหนึ่งของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๒ งาน หรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๓ งาน\r\n'),
(49, 2, 5, '3', '7.20 - 8.80', 'ระดับที่ ๓. ปฎิบัติงานใกล้เคียงกับภาระงานขั้นต่ำ (ระหว่าง ๗.๒๐ – ๘.๘๐ ชั่วโมงทำงาน/สัปดาห์) หรือ เป็นอาจารย์ที่ปรึกษา หรือเป็นกรรมการใดกรรมการหนึ่งของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๒ งานและกรรมการเฉพาะกิจ ๑ งาน'),
(50, 2, 5, '4', '8.81 - 9.60', 'ระดับที่ ๔.มีภาระงานระหว่าง ๘.๘๑ – ๙.๖๐ ชั่วโมงทำงาน/สัปดาห์\r\nหรือ เป็นอาจารย์ที่ปรึกษาและเป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๑ งาน หรือ เป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๔ งาน\r\n'),
(51, 2, 5, '5', 'มากกว่า 9.60', 'ระดับที่ ๕. มีภาระงานมากกว่า ๙.๖๐ ชั่วโมงทำงาน/สัปดาห์หรือ เป็นอาจารย์ที่ปรึกษาและเป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๒ งาน หรือ เป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๕ งาน หรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๖ งาน'),
(52, 3, 1, '1', 'ต่ำกว่า 9.6', 'ระดับที่ ๑. มีภาระงานน้อยกว่า ๙.๖๐ ชั่วโมงทำงาน/สัปดาห์'),
(53, 3, 1, '2', '9.60 - 10.79', 'ระดับที่ ๒. มีภาระงานระหว่าง ๙.๖๐ –๑๐.๗๙ ชั่วโมงทำงาน/สัปดาห์'),
(54, 3, 1, '3', '10.80 - 13.20', 'ระดับที่ ๓. มีภาระงานใกล้เคียงเกณฑ์ภาระงานขั้นต่ำ (ระหว่าง ๑๐.๘๐ –๑๓.๒๐ ชั่วโมงทำงาน/สัปดาห์)และมีแผนการสอนตาม มคอ.๓'),
(55, 3, 1, '4', '13.20 - 14.40', 'ระดับที่ ๔. มีภาระงานอยู่ระหว่าง ๑๓.๒๐-๑๔.๔๐ ชั่วโมงทำงาน/สัปดาห์และมีแผนการสอนตาม มคอ.๓ และมีเอกสารประกอบการสอน/เอกสารคำสอน/ตำรา/สื่อการสอน/อุปกรณ์การสอน ทุกวิชาที่สอน \r\n'),
(56, 3, 1, '5', 'มากกว่า 14.40', 'ระดับที่ ๕. มีภาระงานมากกว่า ๑๔.๔๐ ชั่วโมงทำงาน/สัปดาห์ และมีแผนการสอนตาม มคอ.๓ มีการนำผลการประเมินไปปรับปรุง และมีเอกสารประกอบการสอน/เอกสารคำสอน/ตำรา/สื่อการสอน/อุปกรณ์การสอน ทุกวิชาที่สอน\r\n'),
(57, 3, 2, '1', '', 'ระดับที่ ๑. ไม่ปรากฏผลงาน งานวิจัย หรือ ตำราหรือหนังสือ บทความทางวิชาการ วิชาการ แต่มีการเข้าร่วมกิจกรรมด้านงานวิจัย อย่างน้อย ๒ ครั้งต่อรอบประเมิน'),
(58, 3, 2, '2', '', 'ระดับที่ ๒. ไม่ปรากฏผลงาน งานวิจัย หรือ ตำราหรือหนังสือ บทความทาง แต่มีการเข้าร่วมกิจกรรมด้านงานวิจัย อย่างน้อย ๓ ครั้งต่อรอบประเมิน'),
(59, 3, 2, '3', '', 'ระดับที่ ๓. มีการดำเนินงานวิจัย / เป็นกรรมการที่เกี่ยวข้องกับงานวิจัย '),
(60, 3, 2, '4', '', 'ระดับที่ ๔. มีการดำเนินงานวิจัยและเผยแพร่ผลงานวิจัยในที่ประชุมวิชาการ /เข้าร่วมกิจกรรมด้านการวิจัย/นำผลงานวิจัยไปบูรณาการกับการบริการวิชาการและการเรียนการสอน'),
(61, 3, 2, '5', '', 'ระดับที่ ๕.มีการเผยแพร่บทความทางวิชาการในวารสารวิชาการ ที่อยู่ในฐานข้อมูล ที่ สกอ. รับรอง หรือ ทำตำรา/หนังสือที่ได้รับการเผยแพร่ตามเกณฑ์ที่ ก.พ.อ.กำหนด '),
(62, 3, 3, '1', 'ต่ำกว่า 3.20', 'ระดับที่ ๑. มีภาระงานต่ำกว่า ๓.๒๐ ชั่วโมงทำงาน/สัปดาห์ หรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม                        อย่างน้อย ๑ งาน'),
(63, 3, 3, '2', '3.20 - 3.59', 'ระดับที่ ๒.มีภาระงานระหว่าง ๓.๒๐ – ๓.๕๙ชั่วโมงทำงาน/สัปดาห์ หรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๒ งาน\r\n'),
(64, 3, 3, '3', '3.60 - 4.40', 'ระดับที่ ๓. ปฎิบัติงานใกล้เคียงกับภาระงานขั้นต่ำ (ระหว่าง๓.๖๐ – ๔.๔๐ ชั่วโมงทำงาน/สัปดาห์)\r\nหรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๓ งาน\r\n'),
(65, 3, 3, '4', '4.41 - 4.80', 'ระดับที่ ๔.มีภาระงานระหว่าง ๔.๔๑ – ๔.๘๐ ชั่วโมงทำงาน/สัปดาห์ หรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๔ งาน\r\n'),
(66, 3, 3, '5', 'มากกว่า 4.80', 'ระดับที่ ๕.มีภาระงานมากกว่า ๔.๘๐ ชั่วโมงทำงาน/สัปดาห์ หรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๕ งาน\r\n'),
(67, 3, 4, '1', 'ต่ำกว่า 3.20', 'ระดับที่ ๑. มีภาระงานต่ำกว่า ๓.๒๐ ชั่วโมงทำงาน/สัปดาห์ หรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม                        อย่างน้อย ๑ งาน'),
(68, 3, 4, '2', '3.20 - 3.59', 'ระดับที่ ๒.มีภาระงานระหว่าง ๓.๒๐ – ๓.๕๙ชั่วโมงทำงาน/สัปดาห์ หรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๒ งาน\r\n'),
(69, 3, 4, '3', '3.60 - 4.40', 'ระดับที่ ๓. ปฎิบัติงานใกล้เคียงกับภาระงานขั้นต่ำ (ระหว่าง๓.๖๐ – ๔.๔๐ ชั่วโมงทำงาน/สัปดาห์)\r\nหรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๓ งาน\r\n'),
(70, 3, 4, '4', '4.41 - 4.80', 'ระดับที่ ๔.มีภาระงานระหว่าง ๔.๔๑ – ๔.๘๐ ชั่วโมงทำงาน/สัปดาห์ หรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๔ งาน\r\n'),
(71, 3, 4, '5', '4.41 - 4.80', 'ระดับที่ ๕.มีภาระงานมากกว่า ๔.๘๐ ชั่วโมงทำงาน/สัปดาห์ หรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๕ งาน\r\n'),
(72, 3, 5, '1', 'ต่ำกว่า 6.40', 'ระดับที่ ๑. มีภาระงานต่ำกว่า ๖.๔๐ ชั่วโมงทำงาน/สัปดาห์ หรือเป็นกรรมการใดกรรมการหนึ่งของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๑ งาน หรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๒ งาน\r\n'),
(73, 3, 5, '2', '6.40 - 7.19', 'ระดับที่ ๒.มีภาระงานระหว่าง ๖.๔๐ – ๗.๑๙ ชั่วโมงทำงาน/สัปดาห์\r\nหรือเป็นกรรมการใดกรรมการหนึ่งของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๒ งาน หรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๓ งาน\r\n'),
(74, 3, 5, '3', '7.20 - 8.80', 'ระดับที่ ๓. ปฎิบัติงานใกล้เคียงกับภาระงานขั้นต่ำ (ระหว่าง ๗.๒๐ – ๘.๘๐ ชั่วโมงทำงาน/สัปดาห์) หรือ เป็นอาจารย์ที่ปรึกษา หรือเป็นกรรมการใดกรรมการหนึ่งของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๒ งานและกรรมการเฉพาะกิจ ๑ งาน\r\nหรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๔ งาน\r\n'),
(75, 3, 5, '4', '8.81 - 9.60', 'ระดับที่ ๔.มีภาระงานระหว่าง ๘.๘๑ – ๙.๖๐ชั่วโมงทำงาน/สัปดาห์ หรือ เป็นอาจารย์ที่ปรึกษาและเป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๑ งาน หรือ เป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๔ งาน\r\n'),
(76, 3, 5, '5', 'มากกว่า 9.60', 'ระดับที่ ๕. มีภาระงานมากกว่า ๙.๖๐ ชั่วโมงทำงาน/สัปดาห์หรือ เป็นอาจารย์ที่ปรึกษาและเป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๒ งาน หรือ เป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๕งาน\r\nหรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๖ งาน\r\n'),
(77, 4, 1, '1', 'น้อยกว่า 12.80', 'ระดับที่ ๑.  มีภาระงานน้อยกว่า ๑๒.๘๐ ชั่วโมงทำงาน/สัปดาห์'),
(78, 4, 1, '2', '12.90 - 14.33', 'ระดับที่ ๒.  มีภาระงานระหว่าง ๑๒.๙๐ –๑๔.๓๓ ชั่วโมงทำงาน/สัปดาห์'),
(79, 4, 1, '3', '14.34 - 17.60', 'ระดับที่ ๓.  มีภาระงานใกล้เคียงเกณฑ์ภาระงานขั้นต่ำ (ระหว่าง ๑๔.๓๔ –๑๗.๖๐ ชั่วโมงทำงาน/สัปดาห์) ) และมีแผนการสอนตาม มคอ.๓'),
(80, 4, 1, '4', '17.91 - 19.20', 'ระดับที่ ๔.  มีภาระงานระหว่าง ๑๗.๖๑-๑๙.๒๐ ชั่วโมงทำงาน/สัปดาห์ มีแผนการสอนตาม มคอ.๓ และ มีเอกสารประกอบการสอน/เอกสารคำสอน/ตำรา/สื่อการสอน/อุปกรณ์การสอน ทุกวิชาที่สอน '),
(81, 4, 1, '5', '19.20 ขึ้นไป', 'ระดับที่ ๕.  มีภาระงานมากกว่า ๑๙.๒๐ ชั่วโมงทำงาน/สัปดาห์ มีแผนการสอนตาม มคอ.๓ มีการนำผลการประเมินไปปรับปรุง   และ มีเอกสารประกอบการสอน/เอกสารคำสอน/ตำรา/สื่อการสอน/อุปกรณ์การสอน ทุกวิชาที่สอน '),
(82, 4, 2, '1', '', 'ระดับที่ ๑.  ไม่ปรากฏผลงาน งานวิจัย หรือ ตำราหรือหนังสือ บทความทางวิชาการ วิชาการ แต่มีการเข้าร่วมกิจกรรมด้านงานวิจัย อย่างน้อย ๑ ครั้งต่อรอบประเมิน'),
(83, 4, 2, '2', '', 'ระดับที่ ๒.  ไม่ปรากฏผลงาน งานวิจัย หรือ ตำราหรือหนังสือ บทความทาง แต่มีการเข้าร่วมกิจกรรมด้านงานวิจัย อย่างน้อย ๒ ครั้งต่อรอบประเมิน'),
(84, 4, 2, '3', '', 'ระดับที่ ๓.  มีการยื่นข้อเสนอโครงการวิจัยหรือมีการดำเนินงานวิจัย หรือ เป็นกรรมการที่เกี่ยวข้องกับงานวิจัย '),
(85, 4, 2, '4', '', 'ระดับที่ ๔.  มีการดำเนินงานวิจัยและเข้าร่วมกิจกรรมด้านการวิจัยหรือนำผลงานวิจัยไปบูรณาการกับการบริการวิชาการและการเรียนการสอน'),
(86, 4, 2, '5', '', 'ระดับที่ ๕.  มีการนำเสนอผลงานวิจัยในที่ประชุมวิชาการหรือเผยแพร่บทความทางวิชาการในวารสารวิชาการ ที่ สกอ.รับรอง หรือ ทำตำราหรือหนังสือที่ได้รับการเผยแพร่ตามเกณฑ์ที่ ก.พ.อ.กำหนด'),
(87, 4, 3, '1', 'ต่ำกว่า 3.20', 'ระดับที่ ๑. มีภาระงานต่ำกว่า ๓.๒๐ ชั่วโมงทำงาน/สัปดาห์หรือ เป็นวิทยากรบรรยายพิเศษใน/นอกมหาวิทยาลัย ๑ ครั้งต่อรอบประเมิน หรือร่วมจัดประชุม สัมมนาฝึกอบรมและจัดนิทรรศการ แก่หน่วยงานภายนอก ๑ ครั้งต่อรอบประเมิน'),
(88, 4, 3, '2', '3.20 - 3.59', 'ระดับที่ ๒.มีภาระงานระหว่าง ๓.๒๐ – ๓.๕๙ ชั่วโมงทำงาน/สัปดาห์หรือจัดกิจกรรมตามประกาศ ๙.๑-๙.๓      ๒ ครั้ง ต่อรอบประเมิน หรือ เป็นที่ปรึกษาร่วมโครงการพิเศษนักศึกษา ๑ เรื่อง'),
(89, 4, 3, '3', '3.60 - 4.40', 'ระดับที่ ๓. ปฏิบัติงานใกล้เคียงกับภาระงานขั้นต่ำ (ระหว่าง ๓.๖๐ -๔.๔๐ ชั่วโมงทำงาน/สัปดาห์)\r\nหรือ  มีภาระงานตามประกาศ ข้อ ๙.๑-๙.๓ หน้า ๑๑ ใด ๆ ก็ได้ ๓ เรื่อง หรือ มีภาระงานกิจกรรมใด ๆ ข้อ ก็ได้ ข้อ๙.๑-๙.๓ จำนวน ๒ เรื่อง และเป็นที่ปรึกษาร่วมโครงการวิจัยนักศึกษา ๑ เรื่อง\r\n'),
(90, 4, 3, '4', '4.41 - 4.80', 'ระดับที่ ๔. มีภาระงานระหว่าง ๔.๔๑ – ๔.๘๐ ชั่วโมงทำงาน/สัปดาห์หรือ  มีภาระงานตามประกาศ ข้อ ๙.๑-๙.๓ หน้า ๑๑ ใด ๆ ก็ได้ ๔ เรื่อง หรือ มีภาระงานกิจกรรมใด ๆ ข้อ ก็ได้ ข้อ๙.๑-๙.๓ จำนวน ๓ เรื่อง และเป็นที่ปรึกษาโครงการวิจัยนักศึกษา ๑ เรื่อง'),
(91, 4, 3, '5', 'มากกว่า 4.80', 'ระดับที่ ๕. มีภาระงานมากกว่า ๔.๘๐ ชั่วโมงทำงาน/สัปดาห์ หรือ  มีภาระงานตามประกาศ ข้อ ๙.๑ -๙.๓ หน้า ๑๑ ใด ๆ ก็ได้ ๔ เรื่อง และสามารถหารายได้จากงานภายนอก มากกว่า ๑๐,๐๐๐หรือ มีภาระงานกิจกรรมใด ๆ ข้อ ก็ได้ ข้อ๙.๑-๙.๓ จำนวน ๓ เรื่อง และเป็นที่ปรึกษาโครงการวิจัยนักศึกษา ๑ เรื่องและสามารถหารายได้จากงานภายนอก มากกว่า ๑๐,๐๐๐บาท ขึ้นไป หรือ สามารถหารายได้จากภายนอกตั้งแต่ ๑๐๐,๐๐๐ บาท ขึ้นไป'),
(92, 4, 4, '1', 'ต่ำกว่า 3.20', 'ระดับที่ ๑. มีภาระงานต่ำกว่า ๓.๒๐ ชั่วโมงทำงาน/สัปดาห์ หรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม                       อย่างน้อย ๑ งาน'),
(93, 4, 4, '2', '3.20 - 3.59', 'ระดับที่ ๒.มีภาระงานระหว่าง ๓.๒๐ – ๓.๕๙ชั่วโมงทำงาน/สัปดาห์ หรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๒ งาน\r\n'),
(94, 4, 4, '3', '3.60 - 4.40', 'ระดับที่ ๓. ปฎิบัติงานใกล้เคียงกับภาระงานขั้นต่ำ (ระหว่าง ๓.๖๐ – ๔.๔๐ ชั่วโมงทำงาน/สัปดาห์)\r\nหรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๓ งาน\r\n'),
(95, 4, 4, '4', '4.41 - 4.80', 'ระดับที่ ๔.มีภาระงานระหว่าง ๔.๔๑ – ๔.๘๐ชั่วโมงทำงาน/สัปดาห์ หรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๔ งาน\r\n'),
(96, 4, 4, '5', 'มากกว่า 4.80', 'ระดับที่ ๕.มีภาระงานมากกว่า ๔.๘๐ ชั่วโมงทำงาน/สัปดาห์\r\nหรือ ร่วมกิจกรรมงานที่เกี่ยวข้องกับงานทำนุบำรุงศิลปะ วัฒนธรรมและอนุรักษ์สิ่งแวดล้อม อย่างน้อย ๕ งาน\r\n'),
(97, 4, 5, '1', 'ต่ำกว่า 6.40', 'ระดับที่ ๑. มีภาระงานต่ำกว่า ๖.๔๐ ชั่วโมงทำงาน/สัปดาห์ หรือเป็นกรรมการใดกรรมการหนึ่งของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๑ งาน หรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๒ งาน\r\n'),
(98, 4, 5, '2', '6.40 - 7.19', 'ระดับที่ ๒.มีภาระงานระหว่าง ๖.๔๐ – ๗.๑๙ ชั่วโมงทำงาน/สัปดาห์ หรือเป็นกรรมการใดกรรมการหนึ่งของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๒ งาน หรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๓ งาน\r\n'),
(99, 4, 5, '3', '7.20 - 8.80', 'ระดับที่ ๓. ปฎิบัติงานใกล้เคียงกับภาระงานขั้นต่ำ (ระหว่าง ๗.๒๐ – ๘.๘๐ชั่วโมงทำงาน/สัปดาห์) หรือ เป็นอาจารย์ที่ปรึกษา หรือเป็นกรรมการใดกรรมการหนึ่งของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๒ งานและกรรมการเฉพาะกิจ ๑ งาน\r\nหรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๔ งาน\r\n'),
(100, 4, 5, '4', '8.81 - 9.60', 'ระดับที่ ๔.มีภาระงานระหว่าง ๘.๘๑ – ๙.๖๐ ชั่วโมงทำงาน/สัปดาห์\r\nหรือ เป็นอาจารย์ที่ปรึกษาและเป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๑ งาน หรือ เป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๔ งาน\r\nหรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๕ งาน\r\n'),
(101, 4, 5, '5', 'มากกว่า 9.60', 'ระดับที่ ๕. มีภาระงานมากกว่า ๙.๖๐ ชั่วโมงทำงาน/สัปดาห์หรือ เป็นอาจารย์ที่ปรึกษาและเป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๒ งาน หรือ เป็นกรรมการใดกรรมการหนึ่ง/กรรมการเฉพาะกิจของหลักสูตร/แผนกวิชา/สาขาวิชา/สาขา/คณะ ๕ งาน\r\nหรือกรรมการปฏิบัติเฉพาะกิจ อย่างน้อย ๖ งาน\r\n');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `conditions`
--
ALTER TABLE `conditions`
  ADD PRIMARY KEY (`con_id`),
  ADD KEY `aca_id` (`aca_id`),
  ADD KEY `e_name` (`e_name`);

--
-- Constraints for dumped tables
--

--
-- Constraints for table `conditions`
--
ALTER TABLE `conditions`
  ADD CONSTRAINT `conditions_ibfk_1` FOREIGN KEY (`aca_id`) REFERENCES `academic` (`aca_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `conditions_ibfk_2` FOREIGN KEY (`e_name`) REFERENCES `evaluation` (`e_id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
